Revit 2027 API
RebarHostData.IsFaceExposed Method
 Checks whether the specified face is considered exposed, and therefore has an associated CoverType.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFaceExposed(
	Reference face
)
Public Function IsFaceExposed (
	face As Reference
) As Boolean
public:
bool IsFaceExposed(
	Reference^ face
)
member IsFaceExposed :
        face : Reference -> bool
Parameters
face Reference
Return Value
Boolean
 True if %face% is exposed, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This method replaces the method HasCoverTypeForReference() from the 2011 Revit API.
See Also
Reference
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace